---
kind: type
id: T:Autodesk.Revit.DB.Plane
source: html/6a6ee978-f114-558d-3c69-00d289aa855f.htm
---
# Autodesk.Revit.DB.Plane

A Planar surface.

## Syntax (C#)
```csharp
public class Plane : Surface
```

## Remarks
The parametric equation of the plane is S(u, v) = origin + u*xVec + v*yVec.